# User Data Anlysis
My main goal as of now is to get the age of the average user Birthdays are given, so I will use that to get the ages of the users

In [1]:
import pandas as pd

C:\Users\RhaMo\AppData\Local\Temp\ipykernel_22256\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [9]:
df = pd.read_csv('E:/RhaMo/CSV Files/Anime Dataset/users-details-2023.csv')
df

,Mal ID,Username,Gender,Birthday,Location,Joined,Days Watched,Mean Score,Watching,Completed,On Hold,Dropped,Plan to Watch,Total Entries,Rewatched,Episodes Watched
0,1,Xinil,Male,1985-03-04T00:00:00+00:00,California,2004-11-05T00:00:00+00:00,142.3,7.37,1.0,233.0,8.0,93.0,64.0,399.0,60.0,8458.0
1,3,Aokaado,Male,NaN,"Oslo, Norway",2004-11-11T00:00:00+00:00,68.6,7.34,23.0,137.0,99.0,44.0,40.0,343.0,15.0,4072.0
2,4,Crystal,Female,NaN,"Melbourne, Australia",2004-11-13T00:00:00+00:00,212.8,6.68,16.0,636.0,303.0,0.0,45.0,1000.0,10.0,12781.0
3,9,Arcane,NaN,NaN,NaN,2004-12-05T00:00:00+00:00,30.0,7.71,5.0,54.0,4.0,3.0,0.0,66.0,0.0,1817.0
4,18,Mad,NaN,NaN,NaN,2005-01-03T00:00:00+00:00,52.0,6.27,1.0,114.0,10.0,5.0,23.0,153.0,42.0,3038.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
731285,1291083,Dolopa,NaN,NaN,NaN,2012-05-06T00:00:00+00:00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
731286,1291085,alenrobnik,NaN,NaN,NaN,2012-05-06T00:00:00+00:00,21.4,8.22,16.0,58.0,9.0,1.0,42.0,126.0,0.0,1239.0
731287,1291087,Oblongata,NaN,1993-01-30T00:00:00+00:00,NaN,2012-05-06T00:00:00+00:00,51.3,7.53,38.0,175.0,0.0,9.0,211.0,433.0,2.0,3010.0
731288,1291091,Etnota,NaN,NaN,NaN,2012-05-06T00:00:00+00:00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
731289,1291097,JuunanaSai,Female,NaN,NaN,2012-05-06T00:00:00+00:00,3.7,9.67,1.0,11.0,0.0,0.0,2.0,14.0,0.0,222.0

## Na Values
There are Na values in the column `Birthday`. So, I will drop them, for they are not needed for this analysis

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 731290 entries, 0 to 731289
Data columns (total 16 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Mal ID            731290 non-null  int64
 1   Username          731289 non-null  object
 2   Gender            224383 non-null  object
 3   Birthday          168068 non-null  object
 4   Location          152805 non-null  object
 5   Joined            731290 non-null  object
 6   Days Watched      731282 non-null  float64
 7   Mean Score        731282 non-null  float64
 8   Watching          731282 non-null  float64
 9   Completed         731282 non-null  float64
 10  On Hold           731282 non-null  float64
 11  Dropped           731282 non-null  float64
 12  Plan to Watch     731282 non-null  float64
 13  Total Entries     731282 non-null  float64
 14  Rewatched         731282 non-null  float64
 15  Episodes Watched  731282 non-null  float64
dtypes: float64(10), int64(1), object(5)
memory usage: 89.3+ MB

In [19]:
len(df['Birthday'])

731290

In [23]:
bday = df['Birthday'].dropna()
bday

0         1985-03-04T00:00:00+00:00
5         1988-01-25T00:00:00+00:00
6         1988-02-22T00:00:00+00:00
11        1990-02-09T00:00:00+00:00
12        1983-11-09T00:00:00+00:00
                    ...
731266    1994-08-20T00:00:00+00:00
731269    1996-12-07T00:00:00+00:00
731270    1991-12-11T00:00:00+00:00
731280    1997-12-24T00:00:00+00:00
731287    1993-01-30T00:00:00+00:00
Name: Birthday, Length: 168068, dtype: object

In [24]:
bday.count()

168068

### Converting to Strings
The values in the `Birthday` column need to be converted into strings

In [35]:
df['Birthday'] = df['Birthday'].astype(str)

## Age Function
Creating a function that will get the ages of the users from the years provided in their birthdays

In [26]:
import re

In [57]:
def get_age(birthday):
    # Making a function that will get the age
    def calculate_age(birth_year):
        return 2023 - int(birth_year)
    year_regex = r'(\d{4})-\d{2}-\d{2}T'
    matched = re.match(year_regex, birthday)
    if matched:
        age = calculate_age(matched.group(1))
        return age
    else:
        return 0

### Applying the Function
I am applying the function to the DataFrame; making a new column, `Age`

In [58]:
df['Age'] = df['Birthday'].apply(get_age)

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 731290 entries, 0 to 731289
Data columns (total 17 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Mal ID            731290 non-null  int64
 1   Username          731289 non-null  object
 2   Gender            224383 non-null  object
 3   Birthday          731290 non-null  object
 4   Location          152805 non-null  object
 5   Joined            731290 non-null  object
 6   Days Watched      731282 non-null  float64
 7   Mean Score        731282 non-null  float64
 8   Watching          731282 non-null  float64
 9   Completed         731282 non-null  float64
 10  On Hold           731282 non-null  float64
 11  Dropped           731282 non-null  float64
 12  Plan to Watch     731282 non-null  float64
 13  Total Entries     731282 non-null  float64
 14  Rewatched         731282 non-null  float64
 15  Episodes Watched  731282 non-null  float64
 16  Age               731290 non-null  int64
dtypes: float64(10), int64(2), object(5)
memory usage: 94.8+ MB

In [60]:
df['Age']

0         38
1          0
2          0
3          0
4          0
          ..
731285     0
731286     0
731287    30
731288     0
731289     0
Name: Age, Length: 731290, dtype: int64

In [61]:
df['Birthday']

0         1985-03-04T00:00:00+00:00
1                               nan
2                               nan
3                               nan
4                               nan
                    ...
731285                          nan
731286                          nan
731287    1993-01-30T00:00:00+00:00
731288                          nan
731289                          nan
Name: Birthday, Length: 731290, dtype: object

In [62]:
df['Age'] = df['Age'].astype(int)

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 731290 entries, 0 to 731289
Data columns (total 17 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Mal ID            731290 non-null  int64
 1   Username          731289 non-null  object
 2   Gender            224383 non-null  object
 3   Birthday          731290 non-null  object
 4   Location          152805 non-null  object
 5   Joined            731290 non-null  object
 6   Days Watched      731282 non-null  float64
 7   Mean Score        731282 non-null  float64
 8   Watching          731282 non-null  float64
 9   Completed         731282 non-null  float64
 10  On Hold           731282 non-null  float64
 11  Dropped           731282 non-null  float64
 12  Plan to Watch     731282 non-null  float64
 13  Total Entries     731282 non-null  float64
 14  Rewatched         731282 non-null  float64
 15  Episodes Watched  731282 non-null  float64
 16  Age               731290 non-null  int32
dtypes: float64(10), int32(1), int64(1), object(5)
memory usage: 92.1+ MB